[
	{
		"film" : "Iron Man",
		"released" : "2008-05-02",
		"director" : "Jon Favreau",
		"budget" : "$140 M",
		"box_office" : "$585.2 M",
		"post_credit" : "Having beaten Obadiah Stane and revealed his identity to the world, Tony Stark celebrates by kicking back in his Malibu mansion. He's interrupted when S.H.I.E.L.D. director Nick Fury turns up to inform him of a new initiative he'd like him to be a part of: The Avengers.",
		"link_post_credit" : "https://youtu.be/5MTLm4a9IYY",
		"link_trailer" : "https://www.marvel.com/movies/iron-man",
		"movie_poster" : "Iron Man.jpg",
		"description" : "Iron Man tells the story of Tony Stark, a billionaire industrialist and genius inventor who is kidnapped and forced to build a devastating weapon. Instead, using his intelligence and ingenuity, Tony builds a high-tech suit of armor and escapes captivity. When he uncovers a nefarious plot with global implications, he dons his powerful armor and vows to protect the world as Iron Man"
	},
	{
		"film" : "The Incredible Hulk",
		"released" : "2008/06/18",
		"director" : "Louis Leterrier",
		"budget" : "$150 M",
		"box_office" : "$263.4 M",
		"post_credit" : "General Ross drowns his sorrows for the whole Hulk/Abomination incident in Harlem and is interrupted by Tony Stark, who says him that a new team (The Avengers) is being assembled.",
		"link_post_credit" : "https://youtu.be/FMSET9XhND4",
		"link_trailer" : "https://www.marvel.com/watch/trailers-and-extras/the-incredible-hulk-official-trailer-1",
		"movie_poster" : "The Incredible Hulk.jpg",
		"description" : "In this new beginning, scientist Bruce Banner desperately hunts for a cure to the gamma radiation that poisoned his cells and unleashes the unbridled force of rage within him: Hulk. Living in the shadows--cut off from a life he knew and the woman he loves, Betty Ross--Banner struggles to avoid the obsessive pursuit of his nemesis, General Thunderbolt Ross and the military machinery that seeks to capture him and brutally exploit his power. As all three grapple with the secrets that led to Hulk's creation, they are confronted with a monstrous new adversary known as the Abomination, whose destructive strength exceeds even Hulk's own. One scientist must make an agonizing final choice: accept a peaceful life as Bruce Banner or find heroism in the creature he holds inside--The Incredible Hulk."
	},
	{
		"film" : "Iron Man 2",
		"released" : "2010/05/07",
		"director" : "Jon Favreau",
		"budget" : "$200 M",
		"box_office" : "$623.9 M",
		"post-credit" : "A sleek black car arrives in the New Mexico desert. Agent Coulson steps out, stares off into the distance at an object buried in the ground and calls up Nick Fury. 'Sir, we've found it,' he says... Thor's hammer, Mjolnir.",
		"link_post_credit" : "https://youtu.be/-E2BxeRtdxI",
		"link_trailer" : "https://www.marvel.com/movies/iron-man-2",
		"movie_poster" : "Iron Man 2.jpg",
		"description" : "With the world now aware that he is Iron Man, billionaire inventor Tony Stark faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts and 'Rhodey' Rhodes by his side, Tony must forge new alliances and confront a powerful new enemy."
	},
	{
		"film" : "Thor",
		"released" : "2011/05/06",
		"director" : "Kenneth Branagh",
		"budget" : "$150 M",
		"box_office" : "$449.3 M",
		"post_credit" : "Nick Fury brings Dr. Erik Selvig into S.H.I.E.L.D.'s secret underground facility to show him an artefact that's recently come into their possession - The Tesseract. Selvig gazes at the blue cube, as the camera reveals Loki in his reflection.",
		"link_post_credit" : "https://youtu.be/A5CU4HqQ5EU",
		"link_trailer" : "https://www.marvel.com/movies/thor?playlistVideoId=5806335470001",
		"movie_poster" : "Thor.jpg",
		"description" : "The warrior Thor is cast out of the fantastic realm of Asgard by his father Odin for his arrogance and sent to Earth to live amongst humans. Falling in love with scientist Jane Foster teaches Thor much-needed lessons, and his new-found strength comes into play as a villain from his homeland sends dark forces toward Earth."
	},
	{
		"film" : "Captain America: The First Avenger",
		"released" : "2011/07/22",
		"director" : "Joe Johnston",
		"budget" : "$140 M",
		"box_office" : "$370.6M",
		"post_credit" : "Well aware that he's now living several decades in the future, Cap takes out his frustration on a punching bag, and respons to Nick Fury who just wants him to help save the world again",
		"link_post_credit" : "https://youtu.be/QY8Ni8NLVqc",
		"link_trailer" : "https://youtu.be/JerVrbLldXw",
		"movie_poster" : "Captain America.jpg",
		"description" : "Marvel's Captain America: The First Avenger focuses on the early days of the Marvel Universe when Steve Rogers volunteers to participate in an experimental program that turns him into the Super Soldier known as Captain America."
	},
	{
		"film" : "The Avengers",
		"released" : "2012/05/04",
		"director" : "Joss Whedon",
		"budget" : "$220 M",
		"box_office" : "$1.519 B",
		"post_credit" : "The Other rushes to his master Thanos telling him of Loki's failure to acquire the Tesseract. He babbles about how hard it is to beat The Avengers.",
		"link_post_credit" : "https://youtu.be/Yx2SSzWXG7U",
		"link_trailer" : "https://www.marvel.com/watch/trailers-and-extras/marvel-studios-the-avengers-official-trailer-2",
		"movie_poster" : "Avengers.jpg",
		"description" : "The legendary superheroes Iron Man, Hulk, Thor, Captain America, Hawkeye and the Black Widow are recruited by a secret government agency to fight an unexpected enemy that threatens Earth's security."
	},
	{
		"film" : "Iron Man 3",
		"released" : "2013/05/03",
		"director" : "Shane Black",
		"budget" : "$200 M",
		"box_office" : "$1.215 B",
		"post_credit" : "Tony Stark lies on a therapist's couch, wrapping up a story about his battle with Aldrich Killian. It's revealed that he's actually talking to Bruce Banner, who slept through the entire thing.",
		"link_post_credit" : "https://youtu.be/DhyIWcWkScg",
		"link_trailer" : "https://www.marvel.com/watch/trailers-and-extras/marvel-studios-iron-man-3-official-trailer-2",
		"movie_poster" : "Iron Man 3.jpg",
		"description" : "After saving New York from destruction and remaining sleepless and worried ever since, Tony Stark left without armor must fight his inner fears to defeat his new enemy, the Mandarin."
	},
	{
		"film" : "Thor: The Dark World",
		"released" : "2013/11/08",
		"director" : "Alan Taylor",
		"budget" : "$170 M",
		"box_office" : "$644.6 M",
		"post_credit" : "Sif and Voltstagg have to transport the Aether somewhere safe. They journey to a special museum where they hand it over to Taneleer Tivan, aka The Collector.",
		"link_post_credit" : "https://youtu.be/K1imOiVCgYM",
		"link_trailer" : "https://www.marvel.com/movies/thor-the-dark-world",
		"movie_poster" : "Thor The Dark World.jpg",
		"description" : "Thor teams up with the perfidious Loki to save the Land of the Nine Kingdoms from an ancient enemy born before the universe."
	},
	{
		"film" : "Captain America: The Winter Soldier",
		"released" : "2014/04/04",
		"director" : "Anthony and Joe Russo",
		"budget" : "$177 M",
		"box_office" : "$714.3 M",
		"post_credit" : "Wolfgang Von Strucker chatting with a couple of lackeys in a secret underground Hydra research base, Maximoff twins, Scarlet Witch and Quicksilver, demonstrating their powers.",
		"link_post_credit" : "https://youtu.be/npHT5MAFVaE",
		"link_trailer" : "https://www.marvel.com/movies/captain-america-civil-war",
		"movie_poster" : "Captain America The Winter Soldier.jpg",
		"description" : "Captain America, Black Widow and a new ally, Falcon, face an unexpected enemy as they struggle to bring out a conspiracy that threatens the whole world in the light of the sun."
	},
	{
		"film" : "Guardians of the Galaxy",
		"released" : "2014/08/01",
		"director" : "James Gunn",
		"budget" : "$232 M",
		"box_office" : "$773.3 M",
		"post_credit" : "The Collector's museum looks like a bomb's hit it. That tends to happen when Infinity Stones are opened indoors.",
		"link_post_credit" : "https://youtu.be/x0tDDwOKInw",
		"link_trailer" : "https://www.marvel.com/movies/guardians-of-the-galaxy",
		"movie_poster" : "Guardian of the Galaxy.jpg",
		"description" : "A space adventurer, Brash Peter Quill, becomes prey to some bounty hunters after stealing a sphere coveted by the mighty Ronan. To escape death, the man allies with four unlikely adventure companions."
	},
	{
		"film" : "Avengers: Age of Ultron",
		"released" : "2015/05/01",
		"director" : "Joss Whedon",
		"budget" : "$316 M",
		"box_office" : "$1.405 B",
		"post_credit" : "Thanos is getting sick of his minions' repeated failures to get the Infinity Stones, so we see him grumbling in annoyance as he puts the Infinity Gauntlet on and declares that he'll get the Stones by himself.",
		"link_post_credit" : "https://youtu.be/4d8VTAbotXY",
		"link_trailer" : "https://www.marvel.com/movies/avengers-age-of-ultron",
		"movie_poster" : "Avengers Age of Ultron.jpg",
		"description" : "The Avengers reunite in order to join forces with those of the newcomers Quicksilver and Scarlet. The aim is the fight against the evil robot called Ultron, created by Tony Stark with peaceful intentions but transformed into a bloodthirsty infernal machine."
	},
	{
		"film" : "Ant-Man",
		"released" : "2015/07/17",
		"director" : "Peyton Reed",
		"budget" : "$142 M",
		"box_office" : "$519.3 M",
		"post_credit" : "Hank Pym leads his daughter Hope down into the basement, a panel slides back to reveal a hidden compartment housing the Wasp's suit. Pym tells Hope about the last person to wear it; her mother Janet Van Dyne.",
		"link_post_credit" : "https://youtu.be/2CFMxiDrvk4",
		"link_trailer" : "https://www.marvel.com/movies/ant-man",
		"movie_poster" : "Ant Man.jpg",
		"description" : "Aided by a costume capable of making him smaller and gaining physical strength at the same time, Ant Man is trained by Dr. Hank Pym to control an entire army of ants and fight against Darren Cross in order to prevent the latter from taking possession of the same means and you use them to carry out your evil plans."
	},
	{
		"film" : "Captain America: Civil War",
		"released" : "2016/05/06",
		"director" : "Anthony and Joe Russo",
		"budget" : "$250 M",
		"box_office" : "$1.153 B",
		"post_credit" : "Bucky tells Cap that he will go with T'Challa to Wakanda to recover from mind control",
		"link_post_credit" : "https://youtu.be/Z6Jn8DPjmto",
		"link_trailer" : "https://www.marvel.com/movies/captain-america-civil-war",
		"movie_poster" : "Captain America Civil War.jpg",
		"description" : "Political pressure on the Avengers by the United States government creates growing disagreements between Captain America and Iron Man. When Earth is in danger, the Black Widow and Hawkeye must choose which side to stand on."
	},
	{
		"film" : "Doctor Strange",
		"released" : "2016/11/04",
		"director" : "Scott Derrickson",
		"budget" : "$165 M",
		"box_office" : "$677.7 M",
		"post_credit" : "Thor comes to earth with his brother Loki to look for his father Odin, Strange tells him that he will help them",
		"link_post_credit" : "https://youtu.be/K4ru5ga_qDw",
		"link_trailer" : "https://www.marvel.com/movies/doctor-strange#purchase-6",
		"movie_poster" : "Doctor Strange.jpg",
		"description" : "A doctor falls victim to a tragic accident, but is helped by a wizard who initiates him into the magical arts, thanks to which he manages to redeem himself and fight the dark forces that threaten humanity."
	},
	{
		"film" : "Guardians of the Galaxy Vol. 2",
		"released" : "2017/04/27",
		"director" : "James Gunn",
		"budget" : "$200 M",
		"box_office" : "$863.6 M",
		"post_credit" : "Sylvester Stallone’s character, Stakar Ogord, reunited with some former Ravager companions, all of whom attended Yondu’s funeral, they decided to steal some stuff.",
		"link_post_credit" : "https://youtu.be/A-UOd1LK7jg",
		"link_trailer" : "https://www.marvel.com/movies/guardians-of-the-galaxy-vol-2",
		"movie_poster" : "Guardian of the Galaxy Vol 2.jpg",
		"description" : "Guardians are hired by a powerful alien race to complete a difficult mission. They also have to fight to keep their family together, recently found, while unraveling the mystery of the true origins of Peter Quill."
	},
	{
		"film" : "Spider-Man: Homecoming",
		"released" : "2017/07/07",
		"director" : "Jon Watts",
		"budget" : "$175 M",
		"box_office" : "$880.2 M",
		"post_credit" : "imprisoned Adrian Toomes being approached by Mac Gargan, who says there's a rumour going around that the Vulture knows the true identity of Spider-Man",
		"link_post_credit" : "https://youtu.be/iutGJV8t1_I",
		"link_trailer" : "https://www.marvel.com/movies/spider-man-homecoming",
		"movie_poster" : "Spider-Man Homecoming.jpg",
		"description" : "Spider-Man decides to seek help from his mentor: billionaire Tony Stark, aka Iron Man. The situation becomes more complicated when the criminal known as the Vulture begins to wreak havoc in the city."
	},
	{
		"film" : "Thor: Ragnarok",
		"released" : "2017/11/03",
		"director" : "Taika Waititi",
		"budget" : "$180 M",
		"box_office" : "$853.8 M",
		"post_credit" : "Thor and Loki are aboard their new spaceship home, along with all the refugees of Asgard, trying to decide where to go next, until a huge, shadowy ship appears.",
		"link_post_credit" : "https://youtu.be/PIDBIEuMSD8",
		"link_trailer" : "https://www.marvel.com/movies/thor-ragnarok",
		"movie_poster" : "Thor Ragnarok.jpg",
		"description" : "Thor is imprisoned and deprived of his hammer, finds himself having to fight against Hulk and Hela. He must also be able to reach Asgard and stop Ragnarok, the destruction of his own world."
	},
	{
		"film" : "Black Panther",
		"released" : "2018/02/16",
		"director" : "Ryan Coogler",
		"budget" : "$200 M",
		"box_office" : "$1.346 B",
		"post_credit" : "T’Challa visit the United Nations  so that the new King can tell the world the truth about Wakanda. Shuri wakes up Bucky Barnes and introduces him to Wakanda.",
		"link_post_credit" : "https://youtu.be/GQumkF4gljA",
		"link_trailer" : "https://www.marvel.com/movies/black-panther",
		"movie_poster" : "Black Panther.jpg",
		"description" : "Young Prince T'Challa returns home to the technologically advanced nation of Wakanda. But soon he was forced to seek help from CIA agent Everett K. Ross to defend the throne and avoid a civil war."
	},
	{
		"film" : "The Avengers: Infinity War",
		"released" : "2018/04/27",
		"director" : "Anthony and Joe Russo",
		"budget" : "$316-400 M",
		"box_office" : "$2.005 B",
		"post_credit" : "Thanos’ wave of destruction turns Fury and Maria Hill into ash. We’re left with one final beacon of hope: Nick Fury is desperately trying to contact Captain Marvel and the last image we see is her iconic logo.",
		"link_post_credit" : "https://youtu.be/Xcf7vM4BimM",
		"link_trailer" : "https://www.marvel.com/movies/avengers-infinity-war",
		"movie_poster" : "Avengers Infinity War.jpg",
		"description" : "Iron Man, Thor, Hulk and Avengers unite to fight even their most powerful enemy: the evil Thanos. The fate of the planet and humanity has never been more uncertain."
	},
	{
		"film" : "Ant-Man And The Wasp",
		"released" : "2018/07/06",
		"director" : "Peyton Reed",
		"budget" : "$162–195 M",
		"box_office" : "$622.7 M",
		"post_credit" : "Scott Lang is down in the Quantum Realm aiming to harvest some energy, but remains imprisoned because Thanos turned his friends to dust",
		"link_post_credit" : "https://youtu.be/1RM_rOCHQwE",
		"link_trailer" : "https://www.marvel.com/movies/ant-man-and-the-wasp",
		"movie_poster" : "Ant Man and the Wasp.jpg",
		"description" : "Scott Lang is grappling with the consequences of his choices as a superhero and as a father. The man must once again put on the Ant-Man suit and fight alongside Wasp against a powerful new enemy."
	},
	{
		"film" : "Captain Marvel",
		"released" : "2019/03/08",
		"director" : "Anna Boden, Ryan Fleck",
		"budget" : "$152–175 M",
		"box_office" : "$1.128 B",
		"post_credit" : "While Black Widow, Bruce Banner, and War Machine examining the pager at Avengers HQ, Captain Marvel suddenly shows up behind the trio and asks, 'Where's Fury?'",
		"link_post_credit" : "https://youtu.be/igdB8cCXPZk",
		"link_trailer" : "https://youtu.be/eh_qPcQoFK0",
		"movie_poster" : "Captain Marvel.jpg",
		"description" : "Captain Marvel is an extraterrestrial warrior originally from Kree, who finds herself involved in an intergalactic battle between her own people and that of the Skrulls. She came to live on Earth in 1995 as the American pilot Carol Danvers, continues to have recurring memories of her previous life. With the help of Nick Fury, the woman tries to uncover the secrets of her past by using her special superpowers to end the war with the evil Skrulls."
	},
	{
		"film" : "The Avengers: Endgame",
		"released" : "2019/04/26",
		"director" : "Anthony and Joe Russo",
		"budget" : "$356 M",
		"box_office" : "$2.743 B",
		"post_credit" : "there isn't a post credit scene",
		"link_post_credit" : "n.a.",
		"link_trailer" : "https://youtu.be/TcMBFSGVi1c",
		"movie_poster" : "Avengers Endgame.jpg",
		"description" : "Drifting through space without food or water, Tony Stark sees his oxygen supply drop by the minute. Meanwhile, the remaining Avengers face an epic confrontation with Thanos."
	},
	{
		"film" : "Spider-Man 2: Far From Home",
		"released" : "2019/07/05",
		"director" : "Jon Watts",
		"budget" : "$160 M",
		"box_office" : "$1.12 B",
		"post_credit" : "Peter sees a news report which shows footage from his showdown with Mysterio in London. The super-villain has edited the footage to make Spidey look responsible for the chaos and for Mysterio's death. He also reveals Spider-Man's secret identity.",
		"link_post_credit" : "https://youtu.be/bp1duQcccKQ",
		"link_trailer" : "https://youtu.be/Nt9L1jCKGnE",
		"movie_poster" : "Spider-Man Far From Home.jpg",
		"description" : "Peter Parker's peaceful vacation to Europe takes an unexpected turn when Nick Fury suddenly shows up in his hotel room asking him to collaborate in stopping the evil Mysterio, intent on devastating the continent."
	}
]