
{
	"Captain America" : " Captain America nasce come elemento di propaganda durante gli anni della Seconda Guerra Mondiale. L’idea era di creare un personaggio che incarnasse gli ideali di libertà e democrazia dell’America in contrapposizione all’Europa imperialista. Il personaggio deve i suoi poteri al siero del supersoldato che ne ha radicalmente modificato il DNA, trasformando un ragazzo gracile e con scarse capacità fisiche in un eroe alto, robusto, agile, resistente, immune a sostanze nocive e malattie e con un elevato potere di guarigione. Il siero ha trasformato Rogers in un essere umano praticamente perfetto. Grazie all’addestramento militare ricevuto è un esperto nel combattimento corpo a corpo, nell’uso delle armi ed è un leader naturale. Oltre al costume, che richiama la bandiera americana, simbolo del personaggio Marvel è il suo scudo, creato con una speciale lega di adamantino e vibranio e praticamente indistruttibile, usato sia come arma di difesa che di offesa.",
	"Winter Soldier" : "Braccio destro e spalla di Capitan America durante la Golden Age, Bucky viene dato per morto al termine della seconda guerra mondiale e successivamente resuscitato, fisicamente ed editorialmente, come leggendario agente segreto ed assassino sottoposto al lavaggio del cervello dall'Unione Sovietica che, dopo essere riuscito a recuperare la memoria, torna a difendere il suo paese rimanendo nell'ombra ed arrivando a rivestire, per un breve periodo, i panni dell'ex-mentore Capitan America. ",
	"Nick Fury" : "Il personaggio è un agente segreto ed eroe dell'esercito statunitense; esordisce come capo di un commando reduce della seconda guerra mondiale per poi divenire un agente della CIA per poi passare allo S.H.I.E.L.D., un'agenzia di spionaggio governativa del quale diventerà agente di punta e, successivamente, direttore. Nick Fury è un grande esperto di combattimento corpo a corpo, un pugile categorizzato nei Pesi Massimi, una cintura nera di Tae Kwon Do e una cintura marrone di Jūjutsu che ha avuto come sparring partner perfino Capitan America. Superbo leader e stratega specializzato in tattica militare, ha servito nella seconda guerra mondiale, nella guerra di Corea e in Vietnam nonché in numerosi altri conflitti riportando sia l'addestramento dello U.S.Army come paracadutista, che quelli di ranger, Berretto Verde esperto di esplosivi e pilota di numerose tipologie di veicoli sia di terra che d'aria. È una delle migliori spie dell'Universo Marvel",
	"Captain Marvel" : "Un personaggio che fa della sua abilità di evolvere il suo punto di forza: nel momento di massimo potere è capace di sviluppare un’energia paragonabile a quella dei cosiddetti buchi bianchi (fenomeno ipotizzato dalla scienza in contrapposizione ai buchi neri). Ma non è tutto: Captain Marvel è capace di resistere a qualsiasi veleno o tossina, un po’ come dire che niente può abbattere la Donna Marvel, una sorta di motore dell’universo, capace persino, nei panni di Binary,di controllare la gravità e le forze elettromagnetiche. Un’eroina quindi, che più che supereroe sembra divina, si avvicina all’onnipotenza ma allo stesso tempo rappresenta anche tutto il lato debole della natura umana, l’inevitabilità dell’errore e del senso di colpa. Nei fumetti, infatti, Danvers diventa anche una madre di un figlio non desiderato, frutto di una violenza del figlio stesso: un po’ contorto da spiegare per chi non è appassionato dei comics Marvel, ma sicuramente è da sapere che questa eroina ha affrontato anche un rapimento e, di fatto, un abuso sessuale.",
	"Iron Man" : "Geniale inventore miliardario, playboy e filantropo proprietario delle Stark Industries, Tony Stark viene rapito in Vietnam, rimanendo ferito dall'esplosione di una mina e, anziché costruire armi di distruzione di massa come ordinatogli dai suoi carcerieri, sfrutta il periodo della sua prigionia per costruire un'armatura che possa salvargli la vita e permettergli di fare ritorno in patria, dove assume l'identità di Iron Man divenendo un supereroe nonché membro fondatore dei Vendicatori. Contraddistinto dal carattere carismatico e cordiale risulta tuttavia anche bramoso di potere e spesso disposto a usare sotterfugi, menzogne e inganni (anche ai danni dei propri alleati se lo ritiene necessario), prerogative che lo hanno spesso portato a contrasti con supereroi come l'Uomo Ragno, Thor e soprattutto Capitan America, noti per la spiccata onestà. ",
	"War Machine" : "Nato a Filadelfia, Pennsylvania, James ( War Machine )  ha una sorella maggiore, ed una nipote. Divenuto adulto si arruola negli United States Marine Corps, dove ottiene il grado di tenente. Anni dopo, mentre è impegnato in un conflitto nel Sudest Asiatico, il suo elicottero viene abbattuto da un Viet Cong; sopravvissuto allo schianto fugge attraverso la giungla imbattendosi nell'industriale Tony Stark, appena fuggito dalla prigione del signore della guerra vietnamita Wong Chu. I due, collaborando, riescono a sconfiggere un gruppo di Viet Cong, a rubare un elicottero in una base aerea vietnamita e a ritornare alla più vicina base americana. Prima di separarsi, Stark offre a Rhodey un lavoro alle Stark Industries come suo pilota personale, tuttavia l'uomo decide di accettare tale incarico solo dopo la fine della Guerra del Vietnam ed aver tentato varie altre carriere, tra cui il settore mercenario. Col tempo Rhodey diventa uno dei migliori amici di Stark, nonché uno dei pochi al corrente della sua identità di Iron Man, che aiuta a combattere la Roxxon Oil Company, Justin Hammer e Obadiah Stane. ",
	"Black Widow" : "Assassina biopotenziata arruolata nel servizio di sicurezza sovietico KGB e punta di diamante dello spionaggio del suo paese durante la guerra fredda, la Vedova Nera è stata a lungo avversaria di Iron Man e dei Vendicatori prima di defezionare per gli Stati Uniti e divenire a sua volta una supereroina, membro sia dei Vendicatori che dello S.H.I.E.L.D. di cui è la sola agente di livello 10 oltre a Nick Fury e Quake. Seppur dalla parte del bene, a differenza di molti suoi compagni supereroi, la Vedova Nera utilizza comunque dei metodi estremamente violenti e brutali contro i suoi avversari, non facendosi alcuno scrupolo a torturarli o addirittura ucciderli. ",
	"Hulk" : "Bruce Banner è considerato il più grande scienziato nucleare sulla Terra, nonché il più profondo conoscitore nel campo dei raggi gamma. Oltre alle sue vaste conoscenze in fisica nucleare e subnucleare, Banner ha esperienza anche nei settori dell'ingegneria, della biochimica, della biologia e della medicina, e può creare o controllare tecnologie incredibilmente avanzate. A causa di un fattore genetico sconosciuto, dopo esser stato investito dalle particelle altamente radioattive sprigionate dalla detonazione della Bomba Gamma da lui stesso creata, Banner ha acquisito la capacità di trasformarsi in Hulk. Inizialmente, la trasformazione avveniva automaticamente al tramonto e durava fino all'alba, ma, successivamente, qualcosa nel suo organismo è cambiato e ora la metamorfosi viene innescata dall'adrenalina di Bruce, indipendentemente dall'orario: quando viene sopraffatto da rabbia, stress o paura, o qualora attaccato, ferito o persino sedato, l'ormone dà il via al cambiamento. Hulk è considerato uno degli esseri più potenti dell'Universo Marvel. Innanzitutto, sorpassa i 2,7 metri di statura e poggia su circa 630 kg circa e inoltre dispone di forza, resistenza, velocità, agilità, stamina e riflessi disumani. Riesce infatti, tra le altre cose, a sollevare anche più di 100 tonnellate. Tuttavia, sembra che il suo vero potenziale sia parzialmente trattenuto dalla psiche di Bruce, che cerca di limitare i danni che il Gigante Verde potrebbe causare. Ad ogni modo, più Hulk si arrabbia, si eccita o viene sottoposto a stress, più l'adrenalina fa sì che la sua forza, la sua resistenza e la sua stamina aumentino, un processo che può accrescere la sua potenza in modo potenzialmente illimitato, rendendola, di fatto, incalcolabile. ",
	"Thor" : "Thor è il figlio del padre degli dei di Asgard, Odino e dello spirito della Terra Jord (avatar di Gea). L'obiettivo di Odino era quello di avere un figlio che avesse dei poteri non derivanti esclusivamente dalla patria degli dei celesti. Così Odino creò una caverna in Norvegia, dove Jord diede alla luce Thor. Trascorsa la fanciullezza gettandosi nelle avventure più disparate assieme all'invidioso fratello adottivo Loki e agli amici ben presto, non smentendo la forza e la nobiltà del suo retaggio, Thor diviene il miglior guerriero di Asgard, tanto abile da riuscire a brandire il martello incantato Mjolnir. Oltre a tutti i suoi nemici Thor deve affrontare anche il fratello adottivo Loki, in soccorso dell'eroe asgardiano arrivano Iron Man, Ant-Man e Wasp, grazie ai quali mette in fuga il 'Dio delle Malefatte'. Visto l'ottimo lavoro di squadra, terminata la battaglia i cinque eroi decidono di formare i Vendicatori. Thor, essendo figlio di Odino e Gea è il più potente tra gli asgardiani, difatti, oltre a possedere i poteri comuni a tutta la sua razza, quali forza, resistenza, velocità, agilità e riflessi sovrumani, derivanti dall'avere pelle e ossa circa tre volte più dense di quelle di un comune essere umano, la sua longevità è quasi illimitata. Essendo un dio, è immune alla morte naturale (ma può essere comunque ucciso) e a differenza degli altri Asgardiani, i suoi poteri non subiscono alcuna riduzione spostandosi da Asgard alla Terra. È quasi completamente invulnerabile, i suoi sensi sono tanto acuti da permettergli di localizzare oggetti che si spostano a velocità superluminale o di percepire un suono dall'altra parte del pianeta, le sue capacità di sopportazione sono tali da permettergli di affrontare un'intera armata di Giganti di Ghiaccio per nove mesi senza sosta né sostentamento. ",
	"Loki" : "Nato dal re dei Giganti di Ghiaccio Laufey e da sua moglie Farbauti, Loki, piccolo e minuto per gli standard della sua specie, è causa di profonda vergogna per il padre che, dunque, lo aveva vigliaccamente abbandonato a morire appena nato. Odino grazie ai suoi sensi cosmici si accorge del bambino abbandonato, e piuttosto che lasciarlo morire decise di adottare Loki e di crescerlo come proprio figlio al fianco del suo vero figlio Thor. Allo scopo di eguagliare il fratello, Loki sopperisce allo svantaggio fisico dedicandosi allo studio della magia. Seppur di dimensioni ridotte a causa di un difetto genetico, è in tutto e per tutto un Gigante di Ghiaccio e possiede i poteri comuni a tutti gli esponenti della specie (eccetto la criocinesi) ovvero forza, agilità, velocità, riflessi e resistenza sovrumane, rendendolo più forte e resistente della media degli asgardiani: è infatti in grado di sollevare 50 tonnellate e, sebbene solo sul piano magico, potrebbe in teoria aumentare la sua forza tramite la magia, anche se con effetti temporanei. Come per gli asgardiani, i suoi tessuti sono 3 volte più densi degli umani, rendendolo in grado di reggere proiettili di grosso calibro, cadute da grandi altezze, raggi di energia e ogni altro colpo che sarebbe fatale per un normale asgardiano. La caratteristica distintiva di Loki sono tuttavia i suoi immensi poteri magici: è in grado di creare campi di forza, divenire intangibile, proiettare la sua forma astrale, levitare, rendersi invisibile, emettere energia, ipnotizzare qualsiasi essere vivente, teletrasportarsi tra le dimensioni, viaggiare nel tempo, creare illusioni capaci di raggirare anche un'intera città, trasformare oggetti o dar loro vita. Loki è inoltre in grado di conferire superpoteri ad altri individui.E' anche un mutaforma capace sia di modificare le proprie dimensioni che di assumere le sembianze di qualsiasi altro essere vivente.",
	"Odin" : "E' il padre di Thor e Loki, re di Asgard e grande guerriero. in passato è riuscito a portare la pace nei nove regni sconfiggendo i giganti di ghiaccio. si dice che con il suo occhio possa vedere tutto ciò che succede nei nove regni.",
	"Hawkeye" : "Arciere in costume redentosi da un passato criminoso e dotato di un vasto arsenale di frecce della più disparata foggia e dai molteplici utilizzi, Occhio di Falco è uno storico membro dei Vendicatori che, a discapito del carattere sfacciato e talvolta arrogante spesso motivo di battibecchi coi compagni di squadra, dal suo ingresso tra le file del gruppo ha sempre fatto parte di una sua qualche formazione, sia principale che secondaria, capitanando anche i Vendicatori della Costa Ovest e i Thunderbolts. ",
	"Thanos" : "Il titano Thanos è un essere galattico dotato di una forza ed una resistenza sovraumana ed ha dedicato tutta la sua vita nella ricerca della pace. Vuole raggiungere questo scopo attraverso le gemme dell'infinito, degli artefatti antichi quanto l'universo che, se riunite, hanno il potere di cancellare l'esistenza di interi mondi con un semplice schiocco di dita.",
	"Falcon" : "Dotato della capacità di comunicare con gli uccelli e di volare tramite delle ali artificiali, Falcon è un ex-criminale redento da Capitan America e divenuto in seguito suo amico fraterno e inseparabile spalla nella lotta al crimine, tanto da venire incluso in più formazioni dei Vendicatori e, dopo il ritiro di Steve Rogers, divenire il nuovo Capitan America. Il personaggio è stato il primo supereroe Marvel afroamericano. ",
	"Scarlet Witch" : "Potentissima superumana dotata di immense capacità di alterazione della realtà, Scarlet è la sorella gemella di Quicksilver; inizialmente un'avversaria degli X-Men, è successivamente diventata una supereroina tra i principali membri dei Vendicatori. È ritenuta la mutante più potente del multiverso, spiccando nella classifica dei mutanti di livello omega. Nonostante per anni si sia creduto che lei e il fratello fossero mutanti figli di Magneto, tale parentela è stata successivamente smentita ed è stato rivelato come in realtà i poteri dei due derivino dagli esperimenti dell'Alto Evoluzionario. Nell'universo Marvel ha una figlia, che ha fatto adottare e poi ha ritrovato, Savannah Maximoff, in seguito chiamata Sapphire quando diventa parte degli Avengers. ",
	"Quicksilver" : "Quicksilver ha la capacità sovrumana di muoversi a grande velocità. Nella maggior parte dei raffigurazioni, lui è un mutante , nato con poteri sovrumani. Nelle storie a fumetti a partire dal 2015, è il prodotto della sperimentazione genetica da parte del 'Evoluzionario' . Quicksilver appare più comunemente nella narrativa associata ai X-Men , essendo stata introdotta come un avversario per la squadra di supereroi. Nelle storie successive, è diventato un supereroe lui stesso. E' il fratello gemello di Scarlet e, nella maggior parte delle raffigurazioni, il figlio di Magneto e il fratellastro di Polaris .",
	"Star-Lord" : "Peter Quill nacque durante un particolare fenomeno astronomico in cui molti pianeti si allinearono. Non notando nessuna somiglianza, l'uomo che credeva di essere suo padre accusò la madre di Peter, Meredith, di infedeltà e tentò di uccidere il piccolo solo per poi morire per un attacco di cuore. Peter venne così cresciuto dalla sola madre, finché essa non fu uccisa da un alieno. Quill finì quindi in un orfanotrofio, dal quale scappò per diventare un astronauta presso la NASA. In seguito, mentre si trovava in missione su una stazione spaziale, venne in contatto con un'entità conosciuta come il Signore del Sole, che era alla ricerca di un candidato per il ruolo di Star-Lord. Così, equipaggiato con un'astronave senziente di nome Nave, Peter cominciò la sua carriera di poliziotto interstellare. Peter Quill è molto abile nel combattimento corpo a corpo: è in grado di tenere testa a Gamora ed è anche dotato di notevoli capacità atletiche. Star-Lord era inizialmente dotato di un'armatura e di un elmetto che, modificando la sua struttura fisica, gli garantivano una forza e una resistenza al di là delle capacità umane. L'armatura, oltre a consentirgli di volare e sopravvivere nello spazio, era in grado di formare scudi energetici difensivi. Solitamente usava una coppia di pistole in grado di generare e manipolare gli elementi. ",
	"Gamora" : "Gamora è l'ultimo membro rimasto della sua specie, gli Zen Whoberi, che furono sterminati dai Badoon (nella sua linea temporale originale, furono sterminati dalla Chiesa Universale della Verità). Thanos trovò Gamora da bambina e decise di usarla come un'arma. Gamora venne cresciuta e allenata da Thanos per assassinare Magus, una versione malvagia di Adam Warlock. Thanos mostrò poca gentilezza nei suoi confronti durante la sua infanzia, ma lei rimase fedele all'uomo che le aveva promesso di poter vendicare la morte della sua famiglia. Gamora divenne molto abile nell'uso delle arti marziali, guadagnadosi l'appellativo la donna più mortale della galassia. Quando era adolescente, Thanos le fece fare un viaggio, Gamora dissobedì agli ordini di Thanos e si imbatté in una banda di criminali. Nonostante le sue abilità in combattimento, Gamora venne sopraffatta dal gruppo. Thanos la trovò quasi morta e uccise i suoi assalitori per poi riportarla alla salute ciberneticamente, amplificando le sue abilità a livelli sovrumani. ",
	"Drax the Destroyer" : "Arthur Douglas si trovava alla guida della sua automobile con a bordo la moglie e la figlia e stava percorrendo una strada deserta quando il mezzo venne colpito da un raggio laser sparato da Thanos, il quale non voleva testimoni della sua visita sulla Terra. Sua figlia Heather sopravvisse e fu trovata da Mentore, il padre di Thanos, che la condusse su Titano per allevarla (in seguito la ragazza divenne l'eroina nota come Dragoluna). Arthur invece morì ma il suo spirito venne recuperato dall'essere noto come Kronos e da questi trapiantato in un potente corpo artificiale, creando così Drax il Distruttore, il suo campione nella lotta contro Thanos. Drax ha come obiettivo la distruzione di Thanos e sembra essere l'unica entità in grado di ucciderlo. Ha trascorso molti anni perseguendo l'uccisione di Thanos, alleandosi di tanto in tanto con altri eroi come Adam Warlock per scongiurare minacce di livello cosmico. ",
	"Rocket Raccoon" : "Rocket Raccoon era un guardiano del quadrante Keystone, un'area separata dal resto del cosmo dal Muro Galattico. Rocket è il capitano della nave Rack n' Ruin, e lui, insieme al suo compagno Wal Russ (un tricheco) provengono da Mezzomondo, nel quadrante Keystone, una colonia per malati mentali abbandonata, dove gli animali sono stati sottoposti a operazioni di manipolazione genetica da parte dei robot che governano il pianeta e che gli hanno conferito una intelligenza a livello umano in modo che possano occuparsi dei pazienti. Rocket fu il capo della sicurezza e difese la colonia da varie minacce. Rocket fu scelto da Star-Lord come membro di un gruppo per combattere l'invasione dei Phalanx sul pianeta dei Kree. Rocket si rivelò essere un abile stratega militare, senza paura, leale e astuto. A giudicare da come è talvolta presentato, potrebbe essere affetto da un disturbo ossessivo compulsivo. Rocket diventa un membro dei Guardiani della Galassia, e fu lui a proporre il nome del gruppo dopo aver sentito il Maggiore Victory (il leader della versione classica dei guardiani)",
	"Groot" : "ella sua prima apparizione, Groot era un enorme albero antropomorfo senziente di origine extraterrestre. Giunto sulla Terra per rapire e studiare gli umani, venne ucciso da termiti scatenate da Leslie Evans. In seguito Xemnu lo duplicò per usarlo contro Hulk, ma Groot venne sconfitto. Venne poi catturato dagli Howling Commandos e affidato allo S.H.I.E.L.D. . Groot ha forza e resistenza proporzionali alla sua colossale struttura arborea e può aumentare di molto le sue già notevoli dimensioni. Se viene distrutto può ricrescere completamente a partire da un suo frammento. Il personaggio ha dimostrato la capacità di controllare gli alberi facendoli muovere e crescere a piacimento; è inoltre in grado di adattarsi alle situazioni modificando il suo corpo a piacimento. È anche immune al fuoco.  ",
	"Nebula" : "Una crudele piratessa spaziale e mercenaria, Nebula prese il comando di Sanctuary II, un'astronave che prima di allora apparteneva a Thanos. Thanos era creduto morto in quel periodo, e Nebula sosteneva di essere sua figlia per incutere paura ai suoi nemici (in realtà era la nipote). Nebula è una donna atletica e una eccellente combattente sia nel corpo a corpo che con le armi. Possiede un intelletto geniale ed è una brillante stratega. Nebula usa delle pistole che porta ai polsi che sparano raggi capaci di incenerire un uomo. Ha anche un congegno che le permette di assumere sembianze diverse attraverso la riorganizzazione molecolare del suo corpo e dei suoi vestiti. Venne convertita in un cyborg dal Dr. Mandibus, che le diede un occhio sinistro, braccio e spalla artificiali. La parte sinistra della sua testa fu ricoperta di metallo.",
	"Mantis" : "Poco dopo la sua nascita i suoi genitori sono costretti ad abbandonare la piccola presso il tempio dei Preti di Pama, una setta di sacerdoti kree, nella giungla del Vietnam. I kree si convincono che, secondo la loro religione, la bambina potrà un giorno divenire la Madonna Celestiale e, unendosi a un membro della razza dei Cotati, dare alla luce il Messia Celestiale, ovvero l'essere più potente dell'universo. Raggiunta l'età adulta però alla giovane Mantis viene praticato un lavaggio del cervello, con lo scopo di cancellare temporaneamente tutto ciò che ha appreso al tempio, e viene mandata nel mondo per fare le sue esperienze di vita. Lo Spadaccino, all'epoca appena uscito dai Vendicatori, la incontra in un bar del Vietnam dove lavora come prostituta. I due instaurano una relazione di amicizia e, quando lo Spadaccino ritorna nei Vendicatori, ne entra a far parte anche la stessa Mantis. Come risultato dell'addestramento presso i Preti di Pama, Mantis è sempre stata abile nelle arti marziali. Grazie ad esso possiede inoltre un'istintiva capacità di individuare il punto debole dell'avversario, oltre a un eccezionale controllo del proprio corpo e del proprio sistema vegetativo, e discrete capacità di guarigione. Fin dall'inizio, presenta anche abilità empatiche e telepatiche, anche se non è chiaro fino a che punto esse siano innate (il che la qualificherebbe come una mutante) o frutto dell'addestramento tra i religiosi kree. ",
	"Ultron" : "Ultron è un'intelligenza artificiale estrapolata dalla gemma della mente che si rivela essere cattiva. inizialmente doveva essere usata da Tony per costruire un armata di tute di Iron Man completamente autonome con lo scopo di difendere il pianeta dall'attacco di flotte aliene, ma si ribella e trova un corpo che la ospiti per poi sconfiggere gli avengers e annientare il genere umano, troppo inferiore a lui.",
	"Vision" : "Creato da Ultron come strumento di vendetta, Vision è un androide sintezoide capace di alterare a piacimento la propria massa e solidità corporea, nonché di riprodurre qualsiasi funzione organica di un essere vivente, incluso il pensiero autonomo, cosa che lo ha portato a ribellarsi al suo creatore divenendo un membro di spicco dei Vendicatori. Costantemente in lotta per affermare e mantenere la propria precaria umanità, la più grande paura di Vision è che un giorno possa perderla. Vision è descritto come: «... un essere umano in ogni centimetro... eccetto che tutti i suoi organi corporei sono realizzati in materiale sintetico», la gemma incastonata sulla sua fronte è in grado di assorbire l'energia solare dall'ambiente circostante così da provvedere autonomamente al proprio sostentamento senza aver bisogno di mangiare o bere; ciò gli permette inoltre di emettere raggi ottici di radiazioni a infrarossi o microonde, in casi estremi tale emissione energetica può venire rilasciata direttamente dalla fronte con una potenza distruttiva maggiore ma un conseguente aumento dello sforzo. La peculiare capacità di Vision è tuttavia il totale controllo della propria densità, che gli permette di rendersi completamente intangibile (e per tanto immune ad ogni tipo di attacco e capace di volare) o dotato di un'inamovibilità, invulnerabilità e durezza pari a quella di un diamante, con conseguente aumento della forza fisica. ",
	"Ant-Man" : "I vari Ant-Man possiedono capacità simili, dipendendo esse dalla tecnologia di cui sono attrezzati, che è sostanzialmente la stessa, diventare molto piccolo o gigantesco. Dispongono anche di un pungiglione, un raggio di energia di bassa intensità sufficiente a stordire un uomo, oltre ad avere la capacità di controllare le formiche attraverso il loro casco cibernetico, il quale viene utilizzato anche per sparare raggi bioelettrici dalle antenne. Il terzo Ant-Man è anche dotato di zaini jet e di tre bracci meccanici. La tuta è composta di molecole instabili, affinché si rimpicciolisca o si ingrandisca assieme al suo possessore. Le particelle Pym, possono inoltre, aumentare o diminuire la massa e la forza corporea, proprio come Visione. Inoltre, possono anche utilizzarsi per ridurre determinate parti del corpo, interne ed esterne. L'equipaggiamento base di Ant-Man è composto da due sieri attaccati alla cintura del costume, poi sostituiti da delle pillole rimpicciolenti ed ingrandenti, e da un casco cibernetico capace, non solo di comunicare con le formiche, ma anche di modificare la statura. Il costume è invece costituito da molecole instabili ed è rinforzato per difendere il suo possessore dai morsi degli insetti",
	"Wasp" : " Wasp è in grado di restringersi fino a raggiungere le dimensioni di un insetto e ritornare normale a suo piacimento. Tale processo lascia invariata la sua forza e, sebbene inizialmente richiedesse l'assunzione di una versione gassosa delle Particelle Pym, col passare degli anni è divenuto automatico a causa di una mutazione cellulare provocata dall'uso prolungato della sostanza. Grazie alle modifiche genetiche, possiede inoltre la capacità di comunicare e manipolare gli insetti, che tuttavia usa raramente, e un paio di ali d'insetto biosintetiche impiantate all'altezza delle scapole che può far spuntare solo se miniaturizzata e con le quali è in grado di volare raggiungendo una velocità di 64 Km/h. Nonostante sia in grado di ingigantirsi fino ad un massimo di 100 ft (30 m) aumentando tutte le sue capacità fisiche in proporzione, Wasp preferisce non servirsi di tale potere se non strettamente necessario. Oltre ai suoi poteri, è una esperta combattente corpo a corpo, istruita personalmente da Capitan America, nonché un'eccellente stratega, considerata una dei migliori leader avuti dai Vendicatori. Molto apprezzata anche per le sue doti di designer di moda, possiede infine un'acuta intelligenza e capacità deduttive molto al di sopra della norma. ",
	"Black Panther" : "Pantera Nera è un genio dotato di un quoziente intellettivo elevatissimo tanto da essere considerato una delle otto persone più intelligenti della Terra. Laureatosi in fisica all'Università di Oxford, oltre che come scienziato T'Challa dispone di profonde conoscenze nel campo dell'alchimia ed è uno dei maggiori esperti mondiali di vibranio. In qualità di sovrano del Wakanda è tra le figure più rispettate e influenti della scena politica globale, nonché un capo di stato tanto abile da essere riuscito a risollevare il suo paese da più di una crisi. Grazie agli addestramenti compiuti sin da bambino, T'Challa possiede poi un'eccezionale capacità acrobatica, può muoversi senza emettere il minimo rumore ed è un grande esperto di discipline marziali africane e nella capoeira. In quanto detentore del titolo di Pantera Nera, ottenuto sia per diritto dinastico che superando una serie di prove, T'Challa ha ingerito l'Erba a Foglia di Cuore (Heart-Shaped Herb) la quale, oltre ad un legame mistico con la Dea Pantera Bast, conferisce a colui che se ne nutre (purché appartenga alla famiglia reale) capacità fisiche quali forza, agilità, velocità, riflessi e resistenza soprannaturali, una facoltà di guarigione parecchio più rapida rispetto a quella di un comune essere umano e l'acutissima percezione sensoriale tipica di un animale predatore, grazie alla quale può vedere in condizioni di totale oscurità, riconoscere una persona dal suo odore naturale rintracciandola ovunque essa sia e sentire frequenze che, a un orecchio ordinario, risulterebbero impercettibili.",
	"Spider-Man" : "A seguito del morso di un ragno radioattivo, il personaggio ha acquisito una vasta gamma di poteri: ha forza, resistenza, agilità e velocità proporzionali a quelle di un aracnide, la capacità di aderire ai muri, e il senso di ragno, una sorta di sesto senso che lo avverte dei pericoli di qualsiasi tipo. La sua forza di ragno gli consente di sollevare diverse tonnellate; può sostenere un'automobile sulla testa con poca fatica e rompere oggetti metallici con facilità, e la forza nelle sue gambe gli permette di compiere balzi su distanze e altezze notevoli. In combattimento deve trattenere i suoi colpi contro gli umani normali, che per loro sarebbero fatali, a meno che non combatte contro avversari con forza e resistenza sovrumane. Il suo fisico può resistere ad impatti, scosse elettriche, esplosioni e altri danni fisici che ucciderebbero qualsiasi uomo normodotato. Numerose volte ha subito degli impatti al suolo cadendo da svariati metri senza riportare danni considerevoli e sopravvivendo sempre. Inoltre si stanca molto lentamente, dato che il suo corpo produce meno tossine della fatica. Anche se il suo fattore di guarigione non è potente come quello di Wolverine, Spider-Man può guarire dalla maggior parte delle lesioni (fratture comprese) in soli due giorni. La sua agilità, il suo equilibrio e la sua coordinazione fisica sono superiori a quelle del più preparato atleta umano. Può regolare la sua posizione d'istinto e raggiungere uno stato di perfetto equilibrio in ogni posizione immaginabile. Anche la sua velocità è talmente sviluppata da essere superiore a quella del miglior corridore umano. Inoltre i suoi riflessi sono 15 volte più rapidi del normale. ",
	"Doctor Strange" : " Il Dottor Strange è considerato il più potente mago della Terra. I suoi poteri derivano principalmente dalla connessione coi Vishanti, un trittico di entità mistiche onnipotenti (Agamotto, Oshtur e Hoggoth) che insigniscono il loro campione il titolo di Stregone Supremo, o Mago Supremo,  consentendogli di attingere al loro potere per diventare intangibile, diventare invisibile, emettere energia, generare campi di forza, modificare le leggi spaziotemporali, spostarsi tra le dimensioni parallele o bandirvi qualsiasi creatura, comunicare telepaticamente, ipnotizzare qualunque essere vivente, teletrasportarsi, generare illusioni, spostare gli oggetti col pensiero. È in grado di invocare anche altre entità, utilizzandone gli attributi soprannaturali per dare potere ai suoi incantesimi nonché di servirsi, qualora necessario, sia della magia del caos che della magia nera risultando in grado di padroneggiarla senza lasciarsi consumare. Grazie a un dono fattogli dalla Morte poco dopo la sua nomina a Stregone Supremo inoltre, Strange è virtualmente immortale. "
}
